[
    {
            "watched": true,
            "title": "Free Guy",
            "movie_rating": 3.55,
            "release_date": "2021",
            "review": "I entered the movie expecting to laugh out loud, and I did. Ryan Reynolds and Taika Waititi are comedic geniuses. What I didn't expect is the great chemistry between Ryan and Jodie Comer. Their relationship carried the movie. Also, the trailer and the first act made us believe that it's the generic 'we live in a simulation' movie like many others. But, as we progress, the movie becomes its own thing. And it's fantastic."
    },
    {
            "watched": true,
            "title": "Pixels",
            "movie_rating": 2.8,
            "release_date": "2015",
            "review": "In 1982 in the hopes of establishing peaceful communication with extraterrestrial life, NASA launches a time capsule into outer space containing images and footage of Earth life and culture. However, the aliens misinterpret enclosed video-feeds of classic arcade games as a declaration of war. They attack the Earth using the games as models for their various assaults including Pac-Man, Donkey Kong, Centipede, Space Invaders, Arkanoid and Tetris. Their technology creates voxels that change form and are capable of turning any form of matter into more of itself. President Will Cooper (Kevin James) calls upon his best friend since childhood, former video game professional Sam Brenner (Adam Sandler), who is now a home theater installer and had a previous relationship with Cooper's wife (Jane Krakowski). To combat the video game characters, Brenner decides to lead a team of retrogamers Eddie Plant (Peter Dinklage) and Ludlow Lamonsoff (Josh Gad) to defeat the aliens with technology similar to those used in games. Pixels is a great 2015 American science fiction comedy film all people must see. Ignore the brainwashed haters who are reviewing this movie without even seeing it. See it on my own responsibility,satisfaction guaranteed."
    },
    {
            "watched": true,
            "title": "The Queen's Gambit",
            "movie_rating": 4.3,
            "release_date": "2020",
            "review": "I don't normally review shows but this one was fantastic! I watched the entire series in less then 24 hours and would watch it again in a heartbeat. Every episode is good. It stays strong the entire series and captivates you. I would not be surprised if this show wins tons of awards. 10/10 would recommend."
    },
    {
            "watched": true,
            "title": "The Social Network",
            "movie_rating": 3.9,
            "release_date": "2010",
            "review": "Maybe I'm too old. No, not maybe, I am. I saw this characters as aliens of sorts. I know they represent today's landscape, brrrrr. The film as a film is one of the best of David Fincher but the universe it explores gave the chills. A world approaching its end, fast. The youth of the characters made it even more sinister. I couldn't detect their soul or any evidence of its existence. In a way they represent the worst of the previous generations. Roman Emperors or Wall Street. Profit is the name of the game and the ideas come out of boredom of longings to get laid. Love and friendship, loyalty and/or honor as obsolete as good manners. Jesse Eisenberg is chillingly perfect as the humanoid that started it all - or did he? - Justin Timberlake keeps surprising me. Good, very good and Andrew Garfield, the most recognizable of the characters is a victim of sorts and he'll be destroyed no matter how much money he gets. How I wish this was merely a science-fiction film."
    },
    {
            "watched": false,
            "title": "The Wolf of Wall Street",
            "movie_rating": 4.1,
            "release_date": "2013",
            "review": "Di caprio was robbed in the oscars whether you like it or not, the only reason why people give this movie a low movie_rating is because of the over nudity, and it's the same reason why leo didn't get the oscar in my opinion, which is what I don't understand!!!, it's an r rated movie, so obviously there will be nudity, it's not a kid's movie!!!! , it's easily leo's best performance and scorcese's second best movie after goodfellas."
    },
    {
            "watched": true,
            "title": "The Martian",
            "movie_rating": 4.0,
            "release_date": "2015",
            "review": "Seeing that the movie was over 2 hrs long, and knowing that the person was going to be stuck on the planet by their self for the majority, I didn't have high hopes for it. Usually these types of movies are boring. Not a lot of writers can pull this off. This movie was really good tho. A group of us watched it and really enjoyed. There were some things they failed to explain, that we collectively came up with our own answer for. Other than that, it was great. I never felt bored or left waiting for more. Overall, I feel it was very well written, produced and acted. Well worth the watching. Some people on here have griped that it was 'predictable', but then, most movies are. Who ever watched Star Wars with the thought that Vader would ultimately win??? Who ever watched Star Trek thinking that Kirk wouldn't find a way to save the day? And frankly, who grew up watching Scooby Doo thinking that someone would actually kill Scooby, Shaggy, Fred, Daphne or Velma???"
    },
    {
            "watched": false,
            "title": "Stranger Things",
            "movie_rating": 4.35,
            "release_date": "2016",
            "review": "There is no reason, in terms of story, for Stranger Things to take place in the '80s. But the '80s atmosphere - the dial phones, the chain smoking, Winona Ryder - are there to clue you in on the inspiration for this movie, which is pretty much every supernatural movie from the 80s with a focus on kids. E.T., Poltergeist, that sort of thing. The wondrous thing is how dead-on this tribute. It's not just the clothes and hair, but the style of acting, the scripting approach, the structure, all hold true to their inspiration. You've got the young nerdy kids, the horny, unsure teenagers, the monster, the mysterious one with the power, the bad science/government people, the conflicted investigator, the tearful mom. You could argue that this entire season is simply a pastiche made up of recycled elements, and I wouldn't disagree, but it really feels less like a copy and more like something of that era, as though the writers had fallen into a coma in 1985, woke up and got to working. While it doesn't have the high style of the Spielberg films that are a primary influence, it does have the likability. The story is consistently engaging and fun, the acting is excellent, and the movie has sufficient laughs and tears to satisfy."
    },
    {
            "watched": false,
            "title": "Now You See Me",
            "movie_rating": 3.6,
            "release_date": "2013",
            "review": "Imagine Now You See Me as Ocean's Eleven meets The Prestige and you sort of get what director Louis Leterrier was going for with this film. Is Now You See Me as successful as the aforementioned films? Not necessarily, but it's a fun movie that deconstructs the acts of modern magicians. The story follows four Vegas magicians, known as the Four Horsemen, who rob a bank in the middle of one of their shows. What follows is a cat-and-mouse thriller where the FBI chases after these magicians, always one step behind, trying to figure out how they did it. Where Now You See Me works best is when Leterrier creates cinematic sequences showing us how these magicians used real-life magic tricks to befuddle and dupe both their victims and the FBI. As well, if you want a film with twists and turns, this one will not disappoint. While most of the major twists can be found out before revealed, there is still a joy in watching those twists unfold, thanks to Leterrier's Sherlock Holmes' style of visual deduction. However, the script often falters in one of the most crucial areas, that of character. Leterrier and company are constantly trying to balance the breakneck pace with the large cast of characters, and it just leaves the characters hanging out to dry. Character development is sorely lacking in Now You See Me, to where I never really cared about any of the characters. Part of this is because the film is constantly shifting points of view. The first thirty minutes follow our Robin Hood-like magicians, and then it switches to the FBI agents tracking them down, but then the film has the magicians constantly one step in front of the FBI to the point that it makes the FBI often come across as buffoons, and I find it hard to care for characters who are so easily fooled. Ultimately, I feel that had the film focused entirely on one set of characters, like the magicians or the FBI, the film would have been stronger and been easier to find a focal point, but as it is the film's core is often muddled. While Now You See Me may not be a grand slam, it's still entertaining, thanks to the thrills and visual style of the film. Bottom line, if you're a fan of the heist genre, you'll like this movie. For me though, it just lacks a further script rewrite to have become one of the best examples of the genre. I give Now You See Me an 8 out of 10!"
    },
    {
            "watched": false,
            "title": "Inception",
            "movie_rating": 4.4,
            "release_date": "2010",
            "review": "Inception is good, very good, amazingly good. Music: phenomenal. Story: Exceptional. Acting: Great. Cinematography & Special Effects: Fantastic. Overall this is a great movie, although complicated needing a second watch on my end to fully understand everything, this is a must watch for anyone."
    },
    {
            "watched": true,
            "title": "Forrest Gump",
            "movie_rating": 4.4,
            "release_date": "1994",
            "review": "I believe everyone has a right to their opinion about films or other topics. However from a lot of the comments I have read about this film, I do not think many got the gist of the message from the author and the film maker. This film is a great modern fable, a fable in the dictionary is defined as a brief fictitious story that teaches a moral. There are many morals defined in this film but foremost is integrity and a simple goodness. I have a half brother who grew up in the Southern U.S. and on one occasion we were discussing this film and he said he felt it portrayed Southerners as dimwitted. I disagreed with him and informed him that the author himself was a native Southerner. The setting is central to this story in that it lets the tale unfold tying in factual events with the fable before us. The film is wonderfully directed by Robert Zemeckis, the film is his opus and is acted by a great cast on all levels. From the children who were Forrest Gump and Gump Jr. by Haley Joel Osment. Say what you want but I feel Tom Hanks deserved the Oscar award. Gary Sinise is synonymous with Lt.Dan whenever you hear those words. Sally Fields is the loving dutiful mother in her challenging situation. Mykelti Williamson as Bubba gives you a real sense in the story that Gump had a genuine friend, he moves you with his character. Words don't grasp the full performance of Robin Wright Penn as Jenny. Jennys' tenderness and pain are palpable as exhibited by Wright. I feel that much of Gumps' appeal is his downright sense of doing the right thing regardless of the people and situations around him and we see that in this film. That being the case maybe we all wish we could be just a little more like that, trying to maintain innate goodness and not the trade-offs we often make as we go down lifes highways. The movie has it all too,drama,comedy and it challenges societal norms as well. Then there are the almost endless quotes from the movie that have slipped into everyday speech. They are too numerous to say at this point.One of the toppers for me in the movie is when Forrest is in a quandary about life and wondering as Lt.Dan said we all have a destiny and his Mom says it is where we are all just floating around like a feather in the wind. Forrest's character terms it very well with this quote,'I think it is a little bit of both.' From my experiences in life it does appear to be that way. So if you have not seen the movie,see it soon you are in for a real treat. If you did not like it, give it a try again and hopefully you will see it for the great story it is!"
    }
]